<header class="navbar">
    <link rel="stylesheet" href="assets/views/navbar_omgthatsjackie/navbar.css">
  <a class="navbar__logo" href="main">
    <svg width="200" height="28" viewBox="0 0 200 28" fill="none" xmlns="http://www.w3.org/2000/svg">
      <path fill-rule="evenodd" clip-rule="evenodd"
        d="M0 28V0H11.8789C13.2246 0 14.4668 0.276056 15.6056 0.828169C16.7443 1.38028 17.7277 2.12958 18.5559 3.07606C19.3841 3.99625 20.0181 5.03474 20.4581 6.19155C20.9239 7.34836 21.1568 8.51831 21.1568 9.70141C21.1568 11.3577 20.7686 12.922 19.9922 14.3944C19.2417 15.8667 18.1807 17.0761 16.809 18.0225C15.4633 18.9427 13.8846 19.4028 12.073 19.4028H7.56988V28H0ZM7.56988 12.6986H11.5683C12.0342 12.6986 12.4612 12.4882 12.8494 12.0676C13.2634 11.6206 13.4705 10.8319 13.4705 9.70141C13.4705 8.54457 13.2376 7.75587 12.7717 7.33521C12.3059 6.91456 11.8401 6.70423 11.3742 6.70423H7.56988V12.6986ZM28.4899 26.4225V1.22254H35.3028V26.4225H28.4899ZM43.3152 10.2377C42.8183 11.5418 42.5699 12.8774 42.5699 14.2445C42.5699 15.6747 42.8391 17.0839 43.3773 18.4721C43.9156 19.8392 44.6714 21.0802 45.6444 22.1949C46.6382 23.2887 47.808 24.172 49.1537 24.8451C50.5202 25.4971 52.0212 25.8231 53.6568 25.8231C54.9198 25.8231 56.1931 25.6233 57.4767 25.2237C58.7603 24.803 59.9094 24.2036 60.9239 23.4254C61.9384 22.6471 62.663 21.7112 63.0978 20.6175L58.1599 17.6203C57.9115 18.2933 57.5491 18.8296 57.073 19.2293C56.5968 19.6289 56.0689 19.9234 55.4891 20.1127C54.9094 20.2809 54.3401 20.3651 53.7811 20.3651C52.7252 20.3651 51.8142 20.0916 51.0481 19.5448C50.3028 18.9769 49.7231 18.2408 49.309 17.3363C48.9156 16.4319 48.7189 15.4644 48.7189 14.4338C48.7189 13.4873 48.895 12.5724 49.2469 11.689C49.5988 10.7846 50.1372 10.038 50.8618 9.44901C51.6071 8.86007 52.5596 8.56563 53.7189 8.56563C54.278 8.56563 54.8473 8.64979 55.427 8.81803C56.0274 8.96528 56.5761 9.23866 57.073 9.63831C57.5906 10.038 57.9839 10.6058 58.2531 11.342L62.8804 7.99775C62.1144 6.52544 60.9446 5.34761 59.3711 4.46423C57.7976 3.55981 55.955 3.10761 53.8432 3.10761C52.0833 3.10761 50.4995 3.43361 49.0916 4.08563C47.7044 4.71662 46.5243 5.56845 45.5512 6.64113C44.5782 7.7138 43.8328 8.91268 43.3152 10.2377ZM69.1654 24.0563V4.45634H74.4643V11.9099L80.3339 4.45634H86.3121L79.3012 13.2349L86.8012 24.0563H80.7143L75.9317 16.8513L74.4643 18.3972V24.0563H69.1654ZM101.118 5.67887H96.0404L90.7531 22.4789H95.3882L96.3665 19.1899H100.769L101.77 22.4789H106.382L101.118 5.67887ZM98.5792 10.1983L100.047 16.1138H97.0419L98.5792 10.1983ZM112.644 24.0563V4.45634H125.877V9.1493H117.943V12.4068H124.41V16.7685H117.943V24.0563H112.644ZM138.346 3.2338H132.29V25.6338H138.346V3.2338ZM146.502 26.4225V1.22254H153.315V20.3887H164.565V26.4225H146.502ZM192.43 13.2507V28H200V0H191.77L185.792 13.1718L179.852 0H171.584V28H179.154V13.2507L183.773 23.6225H187.811L192.43 13.2507Z"
        fill="black" />
    </svg>
  </a>

  <nav class="navbar-menu">
    <ul class="navbar-menu__list">
      <li class="navbar-menu__item">
        <a href="#films" class="navbar-menu__link active">Фильмы</a>
      </li>
      <li class="navbar-menu__item">
        <a href="#series" class="navbar-menu__link">Сериалы</a>
      </li>
      <li class="navbar-menu__item">
        <a href="collection" class="navbar-menu__link">Ваша коллекция</a>
      </li>
      <span class="navbar-menu__line"></span>
    </ul>
  </nav>

  <div class="navbar-user">
    <div tabindex="0" class="navbar-user__avatar">
      <img src="assets/images/no_picture.png" alt="avatar image" />
    </div>

    <div class="navbar-user__menu-wrapper">
      <div class="navbar-user__menu">
        <svg class="navbar-user__svg" width="31" height="27" viewBox="0 0 31 27" fill="none"
          xmlns="http://www.w3.org/2000/svg">
          <mask id="mask0" mask-type="alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="31" height="27">
            <rect width="31" height="27" fill="#C4C4C4" />
          </mask>
          <g mask="url(#mask0)">
            <path
              d="M1.25868 23.9396L-4.24142 32.4396C-5.24142 34.2729 -6.04142 38.2396 -1.24142 39.4396H31.2587C36.4587 38.6396 35.7587 34.4396 34.7587 32.4396L30 23.9396L19 6.31456C15.5 0.814524 15.5 0.314697 12 6.31456L1.25868 23.9396Z"
              fill="#F5F5F5" stroke="#E3E3E3" stroke-width="2" />
            <rect x="-5" y="25" width="42" height="18" fill="#F5F5F5" />
          </g>
        </svg>

        <div class="navbar-user__link-list">
          <a href="#films" class="navbar-user__link navbar-user__menu-link">Фильмы</a>
          <a href="#series" class="navbar-user__link navbar-user__menu-link">Сериалы</a>
          <a href="collection" class="navbar-user__link navbar-user__menu-link">Ваша коллекция</a>
          <a href="userPage" class="navbar-user__link">Ваш профиль</a>
          <a href="logout" class="navbar-user__link">Выйти из профиля</a>
        </div>
      </div>
    </div>
  </div>
</header>